# Завдання 3 (використання множин).
# Задано текст з латинських літер. Скласти програму, яка
# визначає і виводить на екран в алфавітному порядку по одному
# разу всі голосні літери латинського алфавіту (множина {a, e, i, o, u,
# y}), які входять в цей текст. Текст та елементи множини задано в
# одному реєстрі (нижньому або верхньому).

# Оголошуємо множину голосних літер латинського алфавіту
vowels = {'A', 'E', 'I', 'O', 'U', 'Y'}  

# Отримуємо введений користувачем текст і перетворюємо його на верхній регістр
text = input("Введіть текст: ").upper()  

# Знаходимо перетин множини голосних із множиною символів у тексті
text_vowel = vowels & set(text)  

# Виводимо знайдені голосні літери у відсортованому алфавітному порядку
print("Голосні у тексті:", "".join(sorted(text_vowel)))  
